alexcvzz.vscode-sqlite
blackboxapp.blackbox
blackboxapp.blackboxagent
bmewburn.vscode-intelephense-client
chatide.chatide
codeium.codeium
continue.continue
danielsanmedium.dscodegpt
docker.docker
donjayamanne.githistory
dracula-theme.theme-dracula
dzhavat.git-cheatsheet
dzylikecode.vscode-drawio-plugin-markdown
eamodio.gitlens
ecmel.vscode-html-css
emanuelebartolesi.powershell-snippets-vscode
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-complete-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
ghutu.perplexity-ext
github.codespaces
github.copilot
github.copilot-chat
github.remotehub
github.vscode-github-actions
github.vscode-pull-request-github
google.geminicodeassist
hediet.vscode-drawio
henriquebruno.github-repository-manager
inferrinizzard.prettier-sql-vscode
kodu-ai.claude-dev-experimental
mechatroner.rainbow-csv
mhutchie.git-graph
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode.azure-repos
ms-vscode.cpptools
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-repositories
ms-vsliveshare.vsliveshare
mtxr.sqltools
nickvd.java-to-drawio-uml
nopeslide.vscode-drawio-plugin-mermaid
nopeslide.vscode-drawio-plugin-rtl
nopeslide.vscode-drawio-plugin-wavedrom
platformio.platformio-ide
prasadbobby.auto-rename-tag
psykosoldi3r.vscode-git-flow
puppet.puppet-vscode
redhat.vscode-yaml
ritwickdey.liveserver
sourcegraph.cody-ai
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
yy0931.vscode-sqlite3-editor
zencoderai.zencoder
zerefdev.todo-highlighter
