alefragnani.pascal
alefragnani.pascal-formatter
antfu.browse-lite
antfu.vite
antigravity-jules-bridge.antigravity-jules-bridge
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
donjayamanne.githistory
dotjoshjohnson.xml
eamodio.gitlens
eclipse-cdt.serial-monitor
editorconfig.editorconfig
elcamilet.ssh-connect
esbenp.prettier-vscode
firefox-devtools.vscode-firefox-debug
foxundermoon.shell-format
github.vscode-github-actions
github.vscode-pull-request-github
google.gemini-cli-vscode-ide-companion
jajera.vsx-remote-ssh
jason2866.esp-decoder
kelvin.vscode-sshfs
mechatroner.rainbow-csv
mhutchie.git-graph
minseokk7.arduino-helper
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.black-formatter
ms-python.debugpy
ms-python.pylint
ms-python.python
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.powershell
ms-vscode.vscode-typescript-next
nordic-semiconductor.nrf-terminal
redhat.vscode-yaml
sst-dev.opencode
streetsidesoftware.code-spell-checker
streetsidesoftware.code-spell-checker-german
tazztone.jules-vscode
timonwong.shellcheck
twxs.cmake
yy0931.save-as-root
zardoy.github-manager
